{
  "backend/main.mo": "Main Motoko actor that includes the MixinStorage blob storage functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: deadline notifications, offline support, document upload UI, dashboard filtering, and responsive UI polish with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, and utilities for the Solar Panel Manager application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using oklch color space.",
  "frontend/index.html": "HTML entry point for the Solar Panel Manager application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with five routes, theme provider, notification hooks, offline sync, and toast notifications.",
  "frontend/src/components/ActiveFilterBadges.tsx": "Displays active dashboard filters as removable badges with special handling for kW range display.",
  "frontend/src/components/DashboardFilters.tsx": "Sheet-based filter panel with controls for panel company selection, kW range slider, and project stage selection with active filter count badge.",
  "frontend/src/components/DocumentList.tsx": "Displays list of uploaded documents with download and delete actions, showing file metadata and empty state.",
  "frontend/src/components/DocumentUploader.tsx": "React component for uploading multiple documents (PDF, JPG, PNG) with drag-and-drop support, file preview list, progress tracking, and simulated upload functionality.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright information and a branded link to caffeine.ai with dynamic year and app identifier.",
  "frontend/src/components/Header.tsx": "Main navigation header with responsive mobile menu, desktop nav links, global search input with live results dropdown, and theme toggle button.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps the app with Header, MobileNavigation, Footer, and renders child routes via Outlet.",
  "frontend/src/components/LoadingSpinner.tsx": "Reusable animated spinner component with configurable size (sm/md/lg) and custom className support.",
  "frontend/src/components/LoadingState.tsx": "Full-page loading state component displaying a large spinner with optional custom message.",
  "frontend/src/components/MobileNavigation.tsx": "Fixed bottom navigation bar for mobile devices with icons and labels for Dashboard, Customers, Tasks, and Reports.",
  "frontend/src/components/NotificationPermissionPrompt.tsx": "Dismissible card prompt that appears after 3 seconds to request browser notification permissions for deadline reminders, with localStorage persistence.",
  "frontend/src/components/OfflineIndicator.tsx": "Fixed alert component that monitors online/offline status and displays sync status with pending changes count.",
  "frontend/src/components/SkeletonLoader.tsx": "Collection of skeleton loading components (CardSkeleton, TableSkeleton, ListSkeleton) for displaying placeholder UI during data fetching.",
  "frontend/src/components/UploadProgressBar.tsx": "Progress bar component for file uploads with status indicators (uploading/complete/error) and color-coded visual feedback.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages backend actor creation with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useDeadlineNotifications.ts": "Hook that monitors task deadlines and sends browser notifications for tasks due within 24 hours, checking hourly and tracking already-notified tasks.",
  "frontend/src/hooks/useGlobalSearch.ts": "Hook that filters customers by name, phone, panel company, or kW size based on search query with minimum 2-character threshold.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOfflineSync.ts": "React hook that monitors online/offline status and automatically refetches all React Query queries when the browser comes back online.",
  "frontend/src/hooks/useProjectFilters.ts": "React hook for managing and applying filters (panel company, kW range, project stage) to project/customer data arrays.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching dashboard data, customers, tasks, and individual customer details, currently using mock data with TypeScript interfaces for solar installation CRM.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, mobile optimizations, and utility classes for a solar CRM application.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/CustomerDetailPage.tsx": "Customer detail page component displaying comprehensive customer information including contact details, solar system specs, tasks, documents, and timeline in a tabbed interface.",
  "frontend/src/pages/CustomersPage.tsx": "Customer list page with search functionality displaying customer cards in a responsive grid layout with filtering by name or phone number.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page component displaying project statistics (total customers, completed installations, pending KSEB/MNRE, total kW), today's tasks, overdue tasks, and high-priority tasks with filtering capabilities and active filter badges.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page component showing business summary statistics including total customers, completed installations, pending KSEB/MNRE, total kW installed, and average system size with icon-based cards.",
  "frontend/src/pages/TasksPage.tsx": "Tasks page component displaying a sortable list of tasks (by deadline or priority) with overdue indicators, customer names, deadlines, and priority badges.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, extended spacing/shadows, and animation keyframes for accordion and other UI components.",
  "project_state.json": "Project state file documenting the solar panel business management app architecture, 8-stage workflow, existing features (deadline reminders, offline support, document uploads, filtering, UI polish), and pending feature requests."
}